# OverallLength Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..OverallLength Property
FabricSheetType Class See Also
---
The length of the wire sheet (including overhangs) in the major direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double OverallLength { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OverallLength As Double
	Get
```

Visual C++
---
```text
public:
property double OverallLength {
	double get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace